INSERT INTO Shinkansen VALUES
(null,'はやぶさ','「320km/h運転可能な盛岡駅以南から直通してくる列車」が北海道新幹線の「はやぶさ」です。
新青森駅〜新函館北斗駅間ノンストップ便のほか、木古内駅に停車する列車、奥津軽いまべつ駅と木古内駅の両方に停車する列車があります。','hayabusa.jpg',
'E5系、H5系','新青森駅・奥津軽いまべつ駅（一部列車）・木古内駅（一部列車）・新函館北斗駅','普通車（指定席のみ）、グリーン車（指定席のみ）、グランクラス（指定席のみ）',
'E5系：普通車（U1〜U28編成）A・E席、最前列・最後列、（U29〜U45編成）全席／グリーン車、グランクラス全席　H5系：全席','なし',1),
(null,'はやて','車両は「はやぶさ」と同じで、所要時間も変わりませんが、盛岡駅〜新青森駅〜新函館北斗駅間のみ運行の列車は320km/h運転を行なう区間が存在しないため「はやぶさ」を名乗らず、「はやて」の名称で運行されています。
新青森駅〜新函館北斗駅間と盛岡駅〜新函館北斗駅間に1往復ずつ設定されており、下りは早朝、上りは夜間のみの設定なので、とてもレアな存在となっています。',
'hayate.jpg','E5系、H5系','新青森駅・奥津軽いまべつ駅・木古内駅・新函館北斗駅','普通車（指定席のみ）、グリーン車（指定席のみ）、グランクラス（指定席のみ）',
'E5系：普通車（U1〜U28編成）A・E席、最前列・最後列、（U29〜U45編成）全席／グリーン車、グランクラス全席','なし',1)

INSERT INTO Category VALUES
(null,'北海道新幹線')